
[{"id":"/blog/always-have-a-solid-backup-plan/","title":"Always Have a Solid Backup Plan","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/always-have-a-solid-backup-plan/","path":"/blog/always-have-a-solid-backup-plan/","published":"2015-02-03T07:00:00-06:00","updated":"2015-02-03T23:43:05-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eThis past autumn, I once again had the opportunity to work with long-time friends and clients, \u003ca target=\"_blank\" href=\"http://relientk.com\"\u003eRelient K\u003c/a\u003e designing and producing merchandise for their upcoming tour. Celebrating the 10-year anniversary of their best-selling album, \u003ca target=\"_blank\" href=\"http://en.wikipedia.org/wiki/Mmhmm\"\u003eMMHMM\u003c/a\u003e, the tour was slated to be a special event for both the band and their fans.\u003c/p\u003e\n\n\u003cp\u003eIn addition to newly designed merchandise, the members of Relient K wanted to reprint classic merchandise from the timeframe of their original record release. This led me to an exploration of art files from 10 years back. Many of these files predated LaCroix Design Co. and I was amazed to find that I had retained so many of the design files and records from this time. We were successfully able to manufacture the classic apparel and the tour was a huge success.\u003c/p\u003e\n\n\u003cp\u003eSince starting LaCroix Design Co. in 2005, we have been victims of a burglary and numerous hard drive failures. The fact that I had retained a collection of files from ten years back was more of a testament to luck than any full-proof backup plan. However, we’ve never been content leaving this up to luck alone.\u003c/p\u003e\n\n\u003cp\u003eFrom the beginning, we have made deliberate decisions to ensure that work we create for our clients is systematically backed up and available for years to come. This is an overview of the redundant system we are using to keep all our files safe.\u003c/p\u003e\n\n\u003ch3\u003eSystem Wide\u003c/h3\u003e\n\n\u003cp\u003eOur backup plan starts with individual computers. This ensures everything on our systems is accessible at any given time. Should we experience a system malfunction, hard drive failure, theft or some other disaster, these backups are available to help us get up and running quickly. These system solutions work in tandem with the other services we outline to provide redundancy.  \u003c/p\u003e\n\n\u003ch4\u003eTime Machine\u003c/h4\u003e\n\n\u003cp\u003eWe start with \u003ca target=\"_blank\" href=\"http://support.apple.com/en-us/HT201250\"\u003eTime Machine\u003c/a\u003e, the built-in backup feature of OS X. This feature retains a copy of our of our files, as well as a feature that expresses how our system looked on any given day. These backups are synced via our wireless network and stored on two separate hard drives.\u003c/p\u003e\n\n\u003ch4\u003eBackblaze\u003c/h4\u003e\n\n\u003cp\u003eTime Machine is a terrific feature, but it is backing up the files to disks which reside at the same physical location as our computers. Thus, we require something that will allow us to backup the bulk of our files to remote storage.\u003c/p\u003e\n\n\u003cp\u003eThis is where \u003ca target=\"_blank\" href=\"http://lcrx.co/1vplTMd\"\u003eBackblaze\u003c/a\u003e excels. For $50 a year, Backblaze will continuously backup an unlimited amount of data from you computer and any drives attached to it. This provides us access to multiple versions of our files through its online interface. Or, we may request the shipment of a hard drive with all of our data on it.\u003c/p\u003e\n\n\u003cp\u003eAlthough this backup process is not a fast as a locally attached device or Time Machine running on our local network, Backblaze provides us with a sound piece of mind knowing that our files are continuously being backed up off-site.\u003c/p\u003e\n\n\u003ch3\u003eDesign Files\u003c/h3\u003e\n\n\u003cp\u003eWe find it important to create an additional level of backup for our design files. Very often, these files can be quite large and a loss of the editable versions would require an inordinate amount of time to recreate.\u003c/p\u003e\n\n\u003ch4\u003eLayerVault\u003c/h4\u003e\n\n\u003cp\u003eFor many years, we stored all of our working design files on Dropbox so that we could access them from anywhere. We have since replaced this with one of my most relied-upon online services, \u003ca target=\"_blank\" href=\"https://layervault.com/r/3X2\"\u003eLayerVault\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eLayerVault provides remote version control for all of our art files and a slew of other vital features. Years ago, we attempted to version-control our design files using Git, which resulted in oversized repositories. Thus, we were thrilled to discover that LayerVault offered this crucial service and provided file previews for each version. We no longer have to save versions of a file out as final-1, final-2, etc.\u003c/p\u003e\n\n\u003cp\u003eIn addition to automatically versioning all of our design files, LayerVault allows us to share project files internally or with an external team. As a result, others involved in a project will always have access to the latest design files and assets.\u003c/p\u003e\n\n\u003cp\u003eFurthermore, LayerVault retains all of our project files and allows us to leave and rejoin a project at any time. Thus, we are able to remove a folder of project files from our computer and rejoin the project at a later date. Doing so will, in turn, sync all of the design files for a project back to our computer.\u003c/p\u003e\n\n\u003ch4\u003eVault Drive\u003c/h4\u003e\n\n\u003cp\u003eAs an added layer of backup, I keep a large hard drive of every LaCroix Design Co. project connected to my computer. As projects are completed, they are organized in folders by year. Additionally, font files and other assets are regularly archived on this drive. Since the drive is attached to my system, it is also backed up using Backblaze. While I imagine that this drive may one day be replaced by \u003ca target=\"_blank\" href=\"http://aws.amazon.com/glacier/\"\u003eAmazon Glacier\u003c/a\u003e or something similar, but this current setup has been working out very well.\u003c/p\u003e\n\n\u003ch3\u003eDevelopment Files\u003c/h3\u003e\n\n\u003cp\u003eAs our design process evolved from building static designs in traditional design applications to a process of iterating, prototyping and building interactive experiences with code, versioning and keeping backups of development files has become immensely important.\u003c/p\u003e\n\n\u003ch4\u003eRepositories\u003c/h4\u003e\n\n\u003cp\u003eAll of our development projects are version-controlled using \u003ca target=\"_blank\" href=\"http://git-scm.com/\"\u003eGit\u003c/a\u003e. We host the majority of these repositories publicly and privately on \u003ca target=\"_blank\" href=\"http://github.com\"\u003eGitHub\u003c/a\u003e and utilize \u003ca target=\"_blank\" href=\"https://bitbucket.org/\"\u003eBitbucket\u003c/a\u003e to host repositories for our smaller projects that we wish to keep private.\u003c/p\u003e\n\n\u003ch3\u003eDocuments \u0026amp; Meeting Notes\u003c/h3\u003e\n\n\u003cp\u003eDocuments for all projects are stored on \u003ca target=\"_blank\" href=\"https://www.google.com/drive/\"\u003eGoogle Drive\u003c/a\u003e and also archived along with all design files onto our Vault Drive upon the completion of each project. \u003ca target=\"_blank\" href=\"http://lcrx.co/1DylAxU\"\u003eEvernote\u003c/a\u003e is used to record all meeting notes, which are then shared internally.\u003c/p\u003e\n\n\u003cp\u003eIf it is not obvious by now, our backup process is very important to us. Being able to provide files and assets years after a project is over allows us to continually exceed the expectations of the clients that partner with us. Feel free to \u003ca target=\"_blank\" href=\"https://twitter.com/lacroixdesign\"\u003ecomment on Twitter\u003c/a\u003e if you have any questions or need clarity as to how we are using these tools and services.\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/always-have-a-solid-backup-plan/always-have-a-solid-backup-plan-15958325.jpg"},{"id":"/blog/website-launch-chicago-food-magazine/","title":"Website Launch: Chicago Food Magazine","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/website-launch-chicago-food-magazine/","path":"/blog/website-launch-chicago-food-magazine/","published":"2015-01-28T15:00:00-06:00","updated":"2015-01-28T15:13:30-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eOf all of the things that we enjoy about Chicago, the food scene is probably at the top of the list. By food scene, I’m not referring to Chicago dogs, deep dish or Italian beef. Instead, I’m talking about the fast-growing assortment of new establishments opening by some of the nation’s most notable new chefs and entrepreneurs. When we are not behind our computers or sketching new ideas at our desks, you will most often find us enjoying craft beers, cocktails and/or a delicious meal somewhere that is most likely becoming our new favorite bar or restaurant.\u003c/p\u003e\n\n\u003cp\u003eYou can imagine our delight when we began talking with \u003ca target=\"_blank\" href=\"http://www.chicagofoodmagazine.com/\"\u003eChicago Food Magazine\u003c/a\u003e back in October. Their team had already begun documenting Chicago’s growing restaurant population through captivating photography. With a vibrant social media presence in place and an ever-growing subscriber base, the team was ready to make their foray into publishing content on their own platform. Their goal was to create an online magazine that provides informative posts on the Chicago food scene in addition to breaking information on news and events.\u003c/p\u003e\n\n\u003cp\u003eThroughout our correspondence with Chicago Food Magazine, we brainstormed features and devised a plan for a publishing platform that would be able to meet their current goals while also providing a strong foundation for future developments. This platform provides the editorial team with tools to publish articles that include a variety of image and social media elements on the responsive website.\u003c/p\u003e\n\n\u003cp\u003eOur design process produced a scalable visual system that would highlight their rich use of photography and provide a pleasant reading experience for visitors. With a large social media following already in place, an important part of the website’s development involved creating a system for sharing content through those channels. To keep followers informed, breaking news is automatically dispersed across those outlets as articles are published.\u003c/p\u003e\n\n\u003cp\u003eWe are thrilled to have had the opportunity to design and develop the new Chicago Food Magazine website. Even more so, we have thoroughly enjoyed the content that the magazine has been producing since launch. Over the next few weeks, we will be discussing the project in more detail through a series of blog posts as well as a case study.\u003c/p\u003e\n\n\u003cp\u003eWe hope that you take the opportunity to experience the new website at \u003ca target=\"_blank\" href=\"http://www.chicagofoodmagazine.com/\"\u003ewww.ChicagoFoodMagazine.com\u003c/a\u003e and hopefully we’ll catch you frequenting one of Chicago’s many top-notch establishments.\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/website-launch-chicago-food-magazine/website-launch-chicago-food-magazine-5777c0b5.jpg"},{"id":"/blog/one-year-of-node-bourbon/","title":"One Year of Node Bourbon","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/one-year-of-node-bourbon/","path":"/blog/one-year-of-node-bourbon/","published":"2014-09-11T12:30:00-05:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"Michael LaCroix","url":"http://www.lacroixdesign.net/team/michael-lacroix/","path":"/team/michael-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/michael-lacroix-4e0cb6be.jpg"},"content":"\u003cp\u003eA year ago we released \u003ca target=\"_blank\" href=\"https://github.com/lacroixdesign/node-bourbon\"\u003enode-bourbon\u003c/a\u003e, our port of \u003ca target=\"_blank\" href=\"http://thoughtbot.com/\"\u003ethoughtbot\u0026rsquo;s\u003c/a\u003e excellent \u003ca target=\"_blank\" href=\"http://bourbon.io/\"\u003eBourbon\u003c/a\u003e library to \u003ca target=\"_blank\" href=\"https://github.com/sass/node-sass\"\u003enode-sass\u003c/a\u003e. Node-sass is a Node.js wrapper of \u003ca target=\"_blank\" href=\"http://libsass.org/\"\u003eLibSass\u003c/a\u003e, an extremely fast version of Sass written in C/C++. The original version of Sass is written in Ruby which \u0026mdash; while a wonderful language \u0026mdash; can be a bit slow. With the forthcoming anniversary, we figured it was due time we wrote a blog post about it.\u003c/p\u003e\n\n\u003cp\u003eIn case you\u0026rsquo;re not familiar, Bourbon is a mixin library for \u003ca target=\"_blank\" href=\"http://sass-lang.com/\"\u003eSass\u003c/a\u003e, the popular CSS preprocessor. Bourbon provides a great amount of utility while appreciatively remaining lean and simple.\u003c/p\u003e\n\n\u003ch3\u003eWhy port it?\u003c/h3\u003e\n\n\u003cp\u003eLibSass introduced a dramatic speed increase in Sass compliation that we wanted to take advantage of in our client-side build tools. The original Bourbon was being utilized in our projects for a couple years at that point, however we ran into compilation issues when trying to include it directly since LibSass does not have 100% feature compatibility with Ruby Sass.\u003c/p\u003e\n\n\u003cp\u003eWe decided to create a project which would include workarounds for those issues, while also providing some conveniences for Node.js-based build tools.\u003c/p\u003e\n\n\u003cp\u003eOur primary goals for the project were:\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eA focus on LibSass compatibility\u003c/li\u003e\n\u003cli\u003ePackaged for npm\u003c/li\u003e\n\u003cli\u003eA convenience method for supplying the project path to both the build tool and to other libraries that might depend on it\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003ch3\u003eHow to use it\u003c/h3\u003e\n\n\u003cp\u003eI\u0026rsquo;ll provide an example for using node-bourbon in a gulp.js project. Assuming you\u0026rsquo;ve already \u003ca target=\"_blank\" href=\"https://github.com/gulpjs/gulp/blob/master/docs/getting-started.md\"\u003eset up gulp\u003c/a\u003e, you\u0026rsquo;ll next want to add node-bourbon to your project:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode class=\"language-bash\"\u003enpm install --save-dev node-bourbon\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eThen in your \u003ccode\u003egulpfile.js\u003c/code\u003e, use node-bourbon in conjuction with gulp-sass. The \u003ccode\u003eincludePaths\u003c/code\u003e property returns an array containing the path to the Bourbon directory. Example usage:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode class=\"language-scss\"\u003evar gulp = require(\u0026#39;gulp\u0026#39;);\nvar sass = require(\u0026#39;gulp-sass\u0026#39;);\n\ngulp.task(\u0026#39;sass\u0026#39;, function () {\n  gulp.src(\u0026#39;path/to/input.scss\u0026#39;)\n    .pipe(sass({\n      includePaths: require(\u0026#39;node-bourbon\u0026#39;).includePaths\n    }))\n   .pipe(gulp.dest(\u0026#39;path/to/output.css\u0026#39;));\n});\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eIf you have additional paths you would like to load, the \u003ccode\u003ewith()\u003c/code\u003e helper can assist:\u003c/p\u003e\n\n\u003cpre\u003e\u003ccode class=\"language-scss\"\u003evar gulp = require(\u0026#39;gulp\u0026#39;);\nvar sass = require(\u0026#39;gulp-sass\u0026#39;);\n\ngulp.task(\u0026#39;sass\u0026#39;, function () {\n  gulp.src(\u0026#39;path/to/input.scss\u0026#39;)\n    .pipe(sass({\n      includePaths: require(\u0026#39;node-bourbon\u0026#39;).with([\u0026#39;first/path\u0026#39;, \u0026#39;second/path\u0026#39;])\n    }))\n   .pipe(gulp.dest(\u0026#39;path/to/output.css\u0026#39;));\n});\n\u003c/code\u003e\u003c/pre\u003e\n\n\u003cp\u003eExamples for other tools can be found in the \u003ca target=\"_blank\" href=\"https://github.com/lacroixdesign/node-bourbon#contents\"\u003ereadme on GitHub\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003eFeel free to \u003ca target=\"_blank\" href=\"https://twitter.com/iamlacroix\"\u003esend me a tweet\u003c/a\u003e if you have any questions!\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/one-year-of-node-bourbon/bourbon-bb162508.jpg"},{"id":"/blog/announcing-our-new-monthly-newsletter/","title":"Announcing Our New Monthly Newsletter","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/announcing-our-new-monthly-newsletter/","path":"/blog/announcing-our-new-monthly-newsletter/","published":"2014-08-26T09:00:00-05:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eWith our inaugural issue nearly complete and subsequent monthly issues already in the works, we are pleased to announce the launch of our new email newsletter. Our first issue will be sent out at the beginning of September and we will be regularly creating original content each month.\u003c/p\u003e\n\n\u003cp\u003eThe format will allow us to approach concepts that do not necessarily fit within the structure of our blog or case studies. This will include a behind the scenes look at what we have been building to inspire new ideas and provide benefit to your business. With these curated briefings, we hope to give readers inside access to what we have been researching, designing, building and thinking. We hope this will be a welcome addition to your inbox and encourage you to \u003ca target=\"_blank\" href=\"http://www.lacroixdesign.net/newsletter/\"\u003esubscribe here\u003c/a\u003e.\n\u2028\nWe have worked with numerous clients over the years to design and develop successful email marketing campaigns. As a result, we have consistently been fascinated with finding better ways to connect to an audience through this medium.\u003c/p\u003e\n\n\u003cp\u003eIt has long been a goal of ours to create our own newsletter. In fact, we have had a form to subscribe on our site for nearly four years. Yet, we have never once sent out a LaCroix Design Co. Newsletter. During this time, we often wrestled with creating valuable email content that our readers would appreciate. As people who regularly receive large amounts of email, we never just wanted to contribute to the noise.\u003c/p\u003e\n\n\u003cp\u003eOur goal with this newsletter is to create something that is candid, genuine and beneficial to our readers. We chose a monthly schedule to ensure that our correspondence is never overwhelming and that the content delivered is relevant.\u2028\u003c/p\u003e\n\n\u003cp\u003eAs with most things that we do, we also view the creation of our own newsletter as a great opportunity to experiment. We are excited to use \u003ca target=\"_blank\" href=\"http://eepurl.com/v7UmP\"\u003eMailchimp’s\u003c/a\u003e wonderful tools and features for an internal project. It will also be exciting to evaluate how our readers are engaging with our content as we go along. Thus, we will welcome any feedback and will seek to continually improve with each issue. It is through this ongoing experiment that we look to gain more knowledge, insight and ideas that we will pass along to our current and future clients.\u003c/p\u003e\n\n\u003cp\u003eWe will be sending out the first issue next week. Feel free to subscribe via the form below.\u003c/p\u003e\n\n\u003cfigure class=\"figure-small\"\u003e\n  \u003cform action=\"//lacroixdesign.us2.list-manage.com/subscribe/post?u=cb74d792445887e99b0a36575\u0026amp;id=9875eb3767\"\n      id=\"mc-embedded-subscribe-form\"\n      class=\"b-form b-newsletter-form\"\n      name=\"mc-embedded-subscribe-form\"\n      method=\"post\"\n      target=\"_blank\"\u003e\n  \u003cdiv class=\"form__required-indicator\"\u003e\n    \u003cspan class=\"input--required-asterisk\"\u003e*\u003c/span\u003e indicates required\n  \u003c/div\u003e\n\n  \u003cdiv class=\"input--group\"\u003e\n    \u003clabel for=\"mce-EMAIL\"\u003eEmail Address  \u003cspan class=\"input--required-asterisk\"\u003e*\u003c/span\u003e\u003c/label\u003e\n    \u003cinput type=\"email\" value=\"\" name=\"EMAIL\" id=\"mce-EMAIL\" class=\"input\"\u003e\n  \u003c/div\u003e\n  \u003cdiv class=\"input--group\"\u003e\n    \u003clabel for=\"mce-FNAME\"\u003eFirst Name\u003c/label\u003e\n    \u003cinput type=\"text\" value=\"\" name=\"FNAME\" id=\"mce-FNAME\" class=\"input\"\u003e\n  \u003c/div\u003e\n  \u003cdiv class=\"input--group\"\u003e\n    \u003clabel for=\"mce-LNAME\"\u003eLast Name\u003c/label\u003e\n    \u003cinput type=\"text\" value=\"\" name=\"LNAME\" id=\"mce-LNAME\" class=\"input\"\u003e\n  \u003c/div\u003e\n\n  \u003cdiv style=\"position: absolute; left: -5000px;\"\u003e\n    \u003cinput type=\"text\" name=\"b_cb74d792445887e99b0a36575_9875eb3767\" tabindex=\"-1\" value=\"\"\u003e\n  \u003c/div\u003e\n\n  \u003cdiv class=\"b-form__actions\"\u003e\n    \u003cbutton type=\"submit\" name=\"subscribe\" class=\"btn\"\u003eSubscribe\u003c/button\u003e\n  \u003c/div\u003e\n\u003c/form\u003e\n\n\u003c/figure\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/announcing-our-new-monthly-newsletter/announcing-our-new-monthly-newsletter-ed34674d.jpg"},{"id":"/blog/lessons-learned-from-working-remotely/","title":"Lessons Learned From Working Remotely","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/lessons-learned-from-working-remotely/","path":"/blog/lessons-learned-from-working-remotely/","published":"2014-08-19T09:00:00-05:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eFrom day one, my business has been a laboratory for experimentation. My time spent working in the music industry piqued my interest in entrepreneurship and small business ventures, but I initially knew very little about running a design studio. With no previous experience as a design employee, my company was a blank canvas for how a design studio could be run. Of course, this has resulted in plenty of mistakes and hard lessons but over time, I\u0026rsquo;ve continually welcomed the opportunity to experiment with all aspects of the business.\u003c/p\u003e\n\n\u003cp\u003eIn the same manner that we use design thinking to deliver successful solutions for our clients, we believe that design thinking can be applied to the process that leads us to those results. Experimentation and iteration provides continual improvement in the way we operate. One such experiment meant moving my company nearly 500 miles from Nashville to Chicago. The relocation provided us with an opportunity to move out of our comfort zone in order to improve as designers and developers. It also made me grow as a business owner. Leaving a small market where my business was established and operating successfully to a much larger market where we would be virtually unknown offered its fair share of opportunities and risk.\u003c/p\u003e\n\n\u003cp\u003eTo ease the transition, Michael remained in Nashville for a year and we began working remotely. Operating out of separate locations meant that we had to adjust our workflows to ensure that the quality of our work would not slip but rather improve as we began to enter a larger market. As with any new experiment, our foray into remote work had its bumps and bruises. Before long, we had adapted and found ourselves relishing in our newfound workflows.\u003c/p\u003e\n\n\u003cp\u003eTwelve months ago, this year-long experiment came to an end as Michael made the move to Chicago so that we could once again work within the same office. Now, with a full year of working beside one another, we have realized that the lessons learned from working remotely have made us better designers, developers and communicators.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eWe became better writers.\u003c/strong\u003e\u003cbr\u003e\nRemote work eliminated the opportunity for casual conversation. Phone calls and video chats consume too much time so we chose to limit those to important occasions. Writing became our main source of communication. This required articulation with our thoughts in order to get our points across clearly and efficiently. Whether using email, project management software or our internal chat software, working remotely demanded deliberate thought when sharing our ideas and critiques.\u003c/p\u003e\n\n\u003cp\u003eIn turn, this helped with client correspondence as well. We devised systems for reviewing and editing proposals or any long-form communications with clients. This required that initial contributor took the time to encompass all of the finer details of the project so that the reviewer would be able to provide edits that helped to clarify the material. Often, we would review documents several times to assure that our correspondence represented the same thoughtfulness that we give to our work.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eWe had to be more organized.\u003c/strong\u003e\u003cbr\u003e\nWhen working remotely, little things that slip through the cracks can\u0026rsquo;t happen. Thus, we had to develop a bulletproof set of systems that we still use today. Completed tasks needed to be recorded so that both partners were keenly aware of what needed to be accomplished. Additionally, keeping files and resources organized was crucial for streamlined workflow at both offices.\u003c/p\u003e\n\n\u003cp\u003eWe relied on our project management software to meet these needs. The tool that we were already using, \u003ca target=\"_blank\" href=\"https://basecamp.com/\"\u003eBasecamp\u003c/a\u003e, was our initial solution. Utilizing email as its notification channel, Basecamp allowed us to also bring clients into the project management software. This way, our clients could observe and communicate as their project was progressing. We have since progressed to using \u003ca target=\"_blank\" href=\"https://trello.com/jameslacroix/recommend\"\u003eTrello\u003c/a\u003e for all internal projects and have begun testing it on some client projects. Trello provides us with a more visual view of the project status. Additionally, tasks can proceed through a series of stages rather than simply complete or incomplete.\u003c/p\u003e\n\n\u003cp\u003eWhile working in remote offices, we still needed to have a channel for regular conversation \u0026mdash; enter chat service. We initially used \u003ca target=\"_blank\" href=\"https://campfirenow.com/\"\u003eCampfire\u003c/a\u003e, followed by \u003ca target=\"_blank\" href=\"https://www.hipchat.com/\"\u003eHipchat\u003c/a\u003e and then happily landed on \u003ca target=\"_blank\" href=\"https://slack.com/r/024l00bf-02533q4k\"\u003eSlack\u003c/a\u003e. To this day, the majority of our conversations still take place in Slack. The service provides separate channels to keep our thoughts organized and the ability to search through these communications at a later time. Seamlessly working with third-party applications, Slack will notify us of Trello updates or Git commits. It will also parse the information from shared links which allow us to quickly share screenshots of ideas using \u003ca target=\"_blank\" href=\"http://www.getcloudapp.com/\"\u003eCloudApp\u003c/a\u003e.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eWe learned to be more decisive.\u003c/strong\u003e\u003cbr\u003e\nOne of the fallbacks of being a designer or developer is overthinking our solutions. We are all guilty of this from time to time. Self-doubt will sometimes creep in and minor iterations end up consuming hours of work only to return to where you first started. When working in the same office, it is quite convenient to distract a co-worker for feedback on every little step. In this circumstance, self-doubt begins to paralyze your workflow. Working remotely required proactive and confident decisions.\u003c/p\u003e\n\n\u003cp\u003eAll in all, this experiment in working remotely has had a lasting, positive\neffect on our non-remote workflows. After working in the\nsame office for a year now, we\u0026rsquo;ve found that these changes have improved the productivity and quality of our work.\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/lessons-learned-from-working-remotely/lessons-learned-from-working-remotely-8efd083e.jpg"},{"id":"/blog/keeping-workplace-morale-high/","title":"Keeping Workplace Morale High","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/keeping-workplace-morale-high/","path":"/blog/keeping-workplace-morale-high/","published":"2014-05-29T16:30:00-05:00","updated":"2015-02-10T12:23:31-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cfigure class=\"image-stretch-wrap\"\u003e\u003cimg alt=\"Dempsey\" class=\"image-fullwidth\" width=\"800\" height=\"800\" src=\"http://www.lacroixdesign.net/images/blog/keeping-workplace-morale-high/dempsey-office-f7fe3a92.jpg\" /\u003e\u003c/figure\u003e\n\n\u003cp\u003eWe love designing and developing for the web. However, there are those rare times when even things that we are passionate about start to feel like hard work. It is for these times that we have recruited the smallest member of our team.\u003c/p\u003e\n\n\u003cp\u003eNamed after a \u003ca target=\"_blank\" href=\"http://cloud.lacroixdesign.net/image/1P2q2o030G0V\"\u003epopular United States soccer star\u003c/a\u003e, Dempsey is tasked with keeping the workplace morale high. She often accomplishes this by launching herself into laps, engaging workers in playful activities or performing hilarious antics. While not condoned in some workplaces, Dempsey is also known to dish out quite gratuitous displays of affection.\u003c/p\u003e\n\n\u003cp\u003eIn addition to keeping morale high, Dempsey fills her day by performing security detail and ensuring that office seating remains occupied if someone goes out to make a coffee. In typical Don Draper-esque fashion, she is quite keen to take an office nap in order to keep the creative juices flowing.\u003c/p\u003e\n\n\u003cp\u003eWe do not know how we got by before this rescued Schnauzer puppy joined us. Aside from piping in on the occasional phone call, most of Dempsey\u0026rsquo;s contributions go unnoticed by those outside of our small design and development team. However, she has become integral part of our inner workings and we figured that it was about time to give credit where credit was due.\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/keeping-workplace-morale-high/dempsey-cover-849deea2.jpg"},{"id":"/blog/signal-tower-interview/","title":"Signal Tower Interview","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/signal-tower-interview/","path":"/blog/signal-tower-interview/","published":"2014-05-28T14:00:00-05:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003e\u003ciframe width=\"100%\" height=\"166\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/96210906\u0026amp;color=ff5500\u0026amp;auto_play=false\u0026amp;hide_related=false\u0026amp;show_artwork=true\"\u003e\u003c/iframe\u003e\u003c/p\u003e\n\n\u003cp\u003eA little less that a year ago, I had the opportunity to sit down for an \u003ca target=\"_blank\" href=\"http://signaltower.co/james-lacroixs-path-to-becoming-a-designer/\"\u003einterview\u003c/a\u003e with Sam Solomon. Sam runs a fantastic site, \u003ca target=\"_blank\" href=\"http://signaltower.co/\"\u003eSignal Tower\u003c/a\u003e, where he interviews various entrepreneurs. I recently realized that we had never shared this interview on the LaCroix Design Co. blog so with the recent launch of our new site, this seemed like the perfect time.\u003c/p\u003e\n\n\u003cp\u003eDuring the interview, Sam and I had the opportunity to discuss what led me into the field of design, why I started LaCroix Design Co. and my time spent being employed in the music industry. As a result, we also had the opportunity cover how that process affects my approach to design. The interview took place shortly after our launch of \u003ca target=\"_blank\" href=\"http://www.1pagesites.net/\"\u003e1 Page Sites\u003c/a\u003e, so we also talk about our package service for single page responsive sites.\u003c/p\u003e\n\n\u003cp\u003eDespite the unflattering still on the for the video placeholder, I had a wonderful time talking with Sam. If you are interested, you can view the entire interview \u003ca target=\"_blank\" href=\"http://signaltower.co/james-lacroixs-path-to-becoming-a-designer/\"\u003ehere\u003c/a\u003e.\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/signal-tower-interview/signal-tower-interview-592eb436.jpg"},{"id":"/blog/doing-more-with-less/","title":"Doing More With Less","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/doing-more-with-less/","path":"/blog/doing-more-with-less/","published":"2014-05-27T12:30:00-05:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eAfter a couple of months of hard work, we recently launched a new site for LaCroix Design Co. Odds are if you are reading this, you\u0026rsquo;ve seen the site and I hope that you are enjoying it.\u003c/p\u003e\n\n\u003cp\u003eI can not recall how many sites for our company have come before this one but I know that this is now the third one that I have worked on with Michael and as with each one before it, I believe that this one is the best yet. Prior to addition of Michael\u0026rsquo;s developer expertise, LaCroix Design Co. consisted of just me. Initially, I had no desire to design for the web and never imagined that I would wish to.\u003c/p\u003e\n\n\u003cp\u003eMy evolution to web designer came out of a necessity. Quite frankly, I needed a way for people to see the graphic design, illustration and identity work that I was doing. Armed with a handful of video tutorials, I began tearing apart WordPress templates in an attempt to mold them into some semblance of a portfolio site.\u003c/p\u003e\n\n\u003cp\u003eEvery time that I discovered something new about the way people interacted with the web or how to develop for it, I would start over and construct a new portfolio site. As a learned to love the design process, this would typically involve coding through the night in order to see something come together by daylight. Sometimes these sites would last months and sometimes mere weeks.\u003c/p\u003e\n\n\u003cp\u003eWith every new site, I sought to do more. I still remember the time that I decided to build an entire site solely because I had learned to animate an accordion menu with a JavaScript library. Every iteration was an experiment utilizing all of the knowledge that I had up to that point. I wanted to include it all.\u003c/p\u003e\n\n\u003cp\u003eThis method continued with the addition of Michael to the team. Michael\u0026rsquo;s skill set and ideas brought super powers to everything that I had been attempting to do. The first LaCroix Design Co. site that we built moved us away from WordPress and onto Expression Engine. This iteration focused on adding more functionality as well as aesthetic bells and whistles.\u003c/p\u003e\n\n\u003cp\u003eAfter that we, we created the predecessor to this site. It was the first responsive web site that we made for ourselves and began to showcase not only the visual nature of our projects but also the design thinking and process that went into them. Not fully content with any content management system available, this site was powered by a custom built web application to demonstrate our studio\u0026rsquo;s development skills.\u003c/p\u003e\n\n\u003cp\u003eThis leads us to our most recent iteration. For the first time in nearly nine years, we did not attempt to add more and sought to reduce wherever possible. Although we are still quite proud of our custom content management system, we abandoned it due to lack of necessity. When both members of the team are comfortable with HTML \u0026amp; CSS, a content management system is overkill and removing it increases the speed of the site. Additionally, we reduced the copy and amount of pages to provide a simpler user experience. Design should facilitate rather than get in the way of the stories that we always want to share through our site.\u003c/p\u003e\n\n\u003cp\u003eBy having less, we have the capability to iterate more quickly. Rather than wait another year or two to create a new site, changes can be quickly made as we examine the interactions taking place. I would trust that the site will not look exactly the same next month as it does today. We are excited about what we have learned and planned to share more specific details about it in the coming weeks and months. We hope that you find delight in the new site and more importantly the work that we have done for our clients.\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/doing-more-with-less/doing-more-with-less-dbabc9ed.jpg"},{"id":"/blog/setting-goals-for-your-web-project/","title":"Setting Goals For Your Web Project","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/setting-goals-for-your-web-project/","path":"/blog/setting-goals-for-your-web-project/","published":"2013-04-15T12:00:00-05:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eEvery great design project begins with clear goals. In a recent post, we wrote about why we ask our clients, \u0026ldquo;\u003ca target=\"_blank\" href=\"/blog/what-does-success-look-like/\"\u003eWhat Does Success Look Like?\u003c/a\u003e\u0026rdquo; Setting concrete goals for a project makes way for successful outcomes. It also creates a path to measure how design adds value to your business.\u003c/p\u003e\n\n\u003cp\u003eStart by asking yourself: \u0026ldquo;Why do I need a website?\u0026rdquo; or \u0026ldquo;Why do I need a new one?\u0026rdquo; If your answers are that the current one is old or looks dated, that is a start. However, there are probably deeper reasons. Most likely, you are wanting a website that is more effective, or one that can help you grow your businesses and generate more income. Your next website should be an tool to help your business flourish.\u003c/p\u003e\n\n\u003cp\u003eIf you are having a difficult time assessing your goals, contact a designer and work with them to help you determine them. Designers are wired to spot opportunities that aren\u0026rsquo;t revealed through traditional analytical thinking. Additionally, they work with businesses on a regular basis and some designers might even be running their own business. Therefore, they make great consultants and can often help you to envision and achieve goals for growing your company - large or small.\u003c/p\u003e\n\n\u003cp\u003eOur most successful projects have come from briefs that had business goals rather than aesthetic goals. Many of these goals began with questions like, \u0026ldquo;How can we …\u0026rdquo; rather than simple requests. In these cases, we have been able to successfully help our clients accomplish goals, such as getting more visitors, keeping them coming back, improving social media interactions, making the experience more personal and many others. If the client had just requested a site instead of looking to solve business goals, these would have never been accomplished.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eHere are some questions that you can ask to set goals for your next web design project.\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003eWhy do you want a website built?\u003c/li\u003e\n\u003cli\u003eWhy is your current website not working?\u003c/li\u003e\n\u003cli\u003eIf this is not built, how will it affect your business financially?\u003c/li\u003e\n\u003cli\u003eIf successful, how will it affect your business positively?\u003c/li\u003e\n\u003cli\u003eIf you were to hire someone to do the job of your website, what would be their job description?\u003c/li\u003e\n\u003cli\u003eDid you do any research to determine that this project was necessary?\u003c/li\u003e\n\u003cli\u003eWhat will determine the success of this project and when will that be evaluated?\u003c/li\u003e\n\u003c/ul\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/setting-goals-for-your-web-project/goals-9edf0e38.jpg"},{"id":"/blog/what-does-success-look-like/","title":"What Does Success Look Like?","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/what-does-success-look-like/","path":"/blog/what-does-success-look-like/","published":"2013-04-04T12:00:00-05:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003ePrior to starting any new project with a client, it\u0026rsquo;s typical to ask a lot of questions. Often, these inquiries help us get a good idea of what the client\u0026rsquo;s business and values are like. Additionally, it helps us to determine the technologies, features and scope involved with the project. However, there is one question that ends up being most important \u0026ndash; \u0026ldquo;What does success look like?\u0026rdquo;\u003c/p\u003e\n\n\u003cp\u003eUltimately, our goal is not to simply deliver logos, websites or web applications. We want to help our clients achieve what they desire for their business. In order to do this, we want to find out what these goals are. From start to finish, having the client\u0026rsquo;s needs in mind will help us to create a process that delivers a viable solution that makes everyone happy. Additionally, there are always ways to exceed the goals. Businesses need much more than just a website. Rather, they are hoping to increase traffic, communicate to their audience efficiently, retain visitors longer and most importantly \u0026ndash; create conversions and increase sales. In the same way, a business doesn\u0026rsquo;t just need a logo. A business should be memorable, look professional and have an identity system that communicates value. A web application should save a business time, alleviate difficulties and make routine tasks easier.\u003c/p\u003e\n\n\u003cp\u003eBefore you begin your next project with a designer or developer, take the time to explore what your goals are. What will determine its success or failure in three months, six months or a year? What will be the value gained through additional revenue or time saved? Those that are worth hiring are not in the business of just making things, they are in the business of making things better. What does success look like for your next project?\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/what-does-success-look-like/success-c977ca46.jpg"},{"id":"/blog/why-choose-responsive-web-design/","title":"Why Choose Responsive Web Design?","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/why-choose-responsive-web-design/","path":"/blog/why-choose-responsive-web-design/","published":"2013-04-01T12:00:00-05:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eA little over a year ago, we designed our first responsive website. \u003ca href=\"http://alistapart.com/article/responsive-web-design\" target=\"_blank\"\u003eResponsive web design\u003c/a\u003e was something that we had been following for awhile but had yet to try on our own. We had both recently read \u003ca href=\"http://ethanmarcotte.com\" target=\"_blank\"\u003eEthan Marcotte\u0026rsquo;s\u003c/a\u003e \u003ca href=\"http://www.abookapart.com/products/responsive-web-design\" target=\"_blank\"\u003ewonderful book\u003c/a\u003e and were in the midst of designing materials for \u003ca href=\"http://nashville.aiga.org\" target=\"_blank\"\u003eAIGA Nashville\u0026rsquo;s\u003c/a\u003e 2012 Student Design Conference, Dish. It just so happened that on this Saturday afternoon, we decided that we were going to take a crack at it and complete the project in a day. It took all night \u0026amp;mdash and several bottles of sake \u0026amp;mdash to complete and as the sun came up, we had our first, albeit very basic, responsive site.\u003c/p\u003e\n\n\u003cp\u003eWe haven\u0026rsquo;t turned back since. Every site that we have designed and developed since then has utilized responsive web design to deliver content appropriately across a vast range of devices. As time went on, our responsive sites improved and so did our process for creating them. No longer fixated on exact pixels sizes, we embraced the dynamic fluidity of the web more and more. With each new site, we used analytics to test our theories and were able to examine how users were interacting with the products that we had created using various devices. We were able to help our clients engage more users at a deeper level.\u003c/p\u003e\n\n\u003cp\u003eRecently, \u003ca href=\"http://www.lukew.com\" target=\"_blank\"\u003eLuke Wroblewski\u003c/a\u003e wrote a fantastic blog post, titled \u003ca href=\"http://www.lukew.com/ff/entry.asp?1691\" target=\"_blank\"\u003eData Monday: Impact of Responsive Designs\u003c/a\u003e. In the post, he gathered the data reported by four sources who have publicly released statistics on the outcome of their responsive websites.\u003c/p\u003e\n\n\u003cblockquote\u003e\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eTime Inc. Responsive Redesign\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003ePages per visit, across mobile, tablet and desktop are up considerably. \u003ca href=\"http://www.magazine.org/timecom-gm-craig-ettinger-bringing-responsive-web-design-iconic-brand\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eMobile is up 23% compared to what it had been. \u003ca href=\"http://www.magazine.org/timecom-gm-craig-ettinger-bringing-responsive-web-design-iconic-brand\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eHomepage uniques are up 15%, and time spent is up 7.5%. \u003ca href=\"http://www.magazine.org/timecom-gm-craig-ettinger-bringing-responsive-web-design-iconic-brand\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003eThe mobile bounce rate decreased by 26%. \u003ca href=\"http://www.magazine.org/timecom-gm-craig-ettinger-bringing-responsive-web-design-iconic-brand\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eO’Neill Clothing Responsive Redesign\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e65.7% conversion rate increase on iPhone/iPod \u003ca href=\"http://electricpulp.com/notes/you-like-apples/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e101.2% revenue growth on iPhone/iPod \u003ca href=\"http://electricpulp.com/notes/you-like-apples/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e407.3% conversion rate increase on Android devices \u003ca href=\"http://electricpulp.com/notes/you-like-apples/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e591.4% revenue growth on Android devices \u003ca href=\"http://electricpulp.com/notes/you-like-apples/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e20.3% conversion rate increase on non-mobile devices \u003ca href=\"http://electricpulp.com/notes/you-like-apples/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e41.1% revenue growth on non-mobile devices \u003ca href=\"http://electricpulp.com/notes/you-like-apples/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eSkinny Ties Responsive Redesign\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e42% revenue growth on all devices \u003ca href=\"http://gravitydept.com/blog/skinny-ties-and-responsive-ecommerce/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e13.6% conversion rate increase \u003ca href=\"http://gravitydept.com/blog/skinny-ties-and-responsive-ecommerce/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e377.6% revenue growth on iPhone \u003ca href=\"http://gravitydept.com/blog/skinny-ties-and-responsive-ecommerce/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e71.9% conversion rate increase on iPhone \u003ca href=\"http://gravitydept.com/blog/skinny-ties-and-responsive-ecommerce/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e44.6% increase in duration \u003ca href=\"http://gravitydept.com/blog/skinny-ties-and-responsive-ecommerce/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e23.3% lower bounce rate \u003ca href=\"http://gravitydept.com/blog/skinny-ties-and-responsive-ecommerce/\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\n\u003cp\u003e\u003cstrong\u003e\u003cem\u003eRegent College Responsive Redesign\u003c/em\u003e\u003c/strong\u003e\u003c/p\u003e\n\n\u003cul\u003e\n\u003cli\u003e99% increase in unique visitors \u003ca href=\"http://domain7.com/work/regent-college\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e77% increase pageviews \u003ca href=\"http://domain7.com/work/regent-college\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003cli\u003e63% increase in online applications \u003ca href=\"http://domain7.com/work/regent-college\" target=\"_blank\"\u003e(source)\u003c/a\u003e\u003c/li\u003e\n\u003c/ul\u003e\n\u003c/blockquote\u003e\n\n\u003cp\u003eAlthough it is only four sources, the numbers reveal the benefits that come as a result of a responsive redesign. We have witnessed similar engagement on higher traffic sites that we have had the opportunity to work on, such as \u003ca target=\"_blank\" href=\"/case-studies/the-5-love-languages/\"\u003eThe 5 Love Languages®\u003c/a\u003e and \u003ca target=\"_blank\" href=\"/case-studies/melanie-joye-lmt/\"\u003eMelanie Joye LMT\u003c/a\u003e. Our goal is to help our clients grow their business. This often includes increasing visitors, retaining visitors, engaging visitors, creating conversions and ultimately creating more revenue. Our experience with responsive web design up to this point has proven to be successful in achieving these goals.\u003c/p\u003e\n\n\u003cp\u003eAlas, we do realize the responsive web design will not be the best solution in every case and that in some circumstances it may be unnecessary. However, we currently find it to be a great solution for many of the clients that we serve. With every client and with every project, we seek to provide the most future friendly solution possible. By creating sites that adapt to viewport size to best showcase the content, we are providing our clients with a solution that delivers a great experience on the devices that exist today as well as those that are still yet to be released.\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/why-choose-responsive-web-design/responsive-6ae98be0.jpg"},{"id":"/blog/dish-2013-student-design-conference/","title":"DISH 2013 Student Design Conference","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/dish-2013-student-design-conference/","path":"/blog/dish-2013-student-design-conference/","published":"2013-02-20T12:00:00-06:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eThe \u003ca href=\"http://2013.dishconference.com\" target=\"_blank\"\u003eDISH 2013 Student Design Conference\u003c/a\u003e kicks off this Friday, February 22, 2013 with keynote speaker, \u003ca href=\"http://tanamachistudio.com\" target=\"_blank\"\u003eDana Tanamachi\u003c/a\u003e. The annual two day conference was always one my favorite events to coordinate during my time serving on the \u003ca href=\"http://nashville.aiga.org\" target=\"_blank\"\u003eAIGA Nashville\u003c/a\u003e board. This year, we once again had the opportunity to create the website for the event. You can read more about the new responsive website here. If you are a student in the Nashville area, then I highly recommend that you register for this event at \u003ca href=\"http://2013.dishconference.com\" target=\"_blank\"\u003eDishConference.com\u003c/a\u003e.\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/dish-2013-student-design-conference/dish-2013-showcase-1000cf5d.jpg"},{"id":"/blog/new-adventures-in-collaboration-apps-services-part-3/","title":"New Adventures In Collaboration (Part 3)","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/new-adventures-in-collaboration-apps-services-part-3/","path":"/blog/new-adventures-in-collaboration-apps-services-part-3/","published":"2013-01-18T12:00:00-06:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eIn the \u003ca target=\"_blank\" href=\"/blog/new-adventures-in-collaboration-apps-services-part-1\"\u003efirst post\u003c/a\u003e of this series, I talked about the tools that we are regularly using for collaboration internally at \u003ca target=\"_blank\" href=\"/\"\u003eLaCroix Design Co.\u003c/a\u003e and for external collaboration with our clients. The \u003ca target=\"_blank\" href=\"/blog/new-adventures-in-collaboration-apps-services-part-2\"\u003esecond installment\u003c/a\u003e delved into the services and applications that facilitate the collaborative iteration in our design process. We see our process as one that is evolving and ever improving. Therefore, this third and final post on our collaborative tools will focus on tools that we have recently implemented into our routine. Since we are always experimenting, this is far from exhaustive. Rather, it represents tools that we expect to remain in our arsenal for some time.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eÜberConference\u003c/strong\u003e \u0026mdash; \u003cem\u003e\u003ca href=\"http://www.uberconference.com\" target=\"_blank\"\u003eUberConference.com\u003c/a\u003e\u003c/em\u003e\u003cbr\u003e\nUnexpected phone calls are a disruptive part of the workday. Most often, we are focused on the the projects that we are creating for our clients and are not at a point that would accommodate breaking away. In order to keep an uninterrupted workflow, we schedule phone conversations with clients in advance much like we would schedule a physical meeting. This allows us to set aside whatever we are working on to give full attention to communicating with the client.\u003c/p\u003e\n\n\u003cp\u003eMost likely when we\u0026rsquo;re collaborating with a client, there are several members of their team that are involved in the process. Therefore, we like to include everyone involved as often as possible so that decisions made are best for the final outcome of the project. Often, this involves conference calls. Having multiple people on a call can sometimes be chaotic. Also, it is difficult to follow who you are talking with unless you are very familiar with the sound of their voice.\u003c/p\u003e\n\n\u003cp\u003eÜberConference has been able to solve a number of these problems for us. The service lets us schedule call with our clients and sends out a reminder prior to the call. Users can call into the conference line by phone, the iOS application or by using a Chrome browser window. Online, it has a visual interface that highlights who is speaking so that we are able to know who we should be responding to. If the users have set up a profile, it also displays a profile image which makes the experience a bit more personal.\u003c/p\u003e\n\n\u003cp\u003eAlthough these features will not replace the experience of being in the same room with our clients, they do greatly improve upon the conference call experience. By removing some the confusion and distraction, phone meetings end with better understanding. Additionally, ÜberConference allows for us to make a recording of the phone call. Once the call is complete, we receive an email documenting who was on the call, the duration, who talked the most and who talked the least.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eHarvest\u003c/strong\u003e \u0026mdash; \u003cem\u003e\u003ca href=\"http://www.getharvest.com\" target=\"_blank\"\u003eGetHarvest.com\u003c/a\u003e\u003c/em\u003e\u003cbr\u003e\nAfter quite a bit of research, we have switched our system for invoicing this year. While, invoicing is often not a collaborative effort, tracking the time invested in each project is. Most of our projects are not based on an hourly rate but rather a proposal of cost and services to align with a client\u0026rsquo;s budget. Tracking time on these projects allows us to assess the time spent on each completed project. These assessments help us to better predict what features and services can be accomplished within the budgets of future projects.\u003c/p\u003e\n\n\u003cp\u003eHarvest makes tracking time fantastically simple whether it is done through the web interface, iOS application or native OS X application. Most importantly, a Chrome extension allows for time to be tracked directly from Basecamp tasks. Thus, it fits perfectly into our existing collaboration process. Since the service is web based, both Michael and I are able to record the time associated to each completed task.\u003c/p\u003e\n\n\u003cp\u003eIn addition to being able to easily track time, Harvest allows us to add expenses, with attached receipts, to internal and external projects. Since we work virtually with a great majority of our clients, Harvest further compliments our process by providing a link on each invoice which allows for clients to pay for their invoice online. Great efficiency in our administration tasks grants us more time to creatively solve our clients\u0026#39; design problems.\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/new-adventures-in-collaboration-apps-services-part-3/collaboration-part-3-5b666525.jpg"},{"id":"/blog/new-adventures-in-collaboration-apps-services-part-2/","title":"New Adventures In Collaboration (Part 2)","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/new-adventures-in-collaboration-apps-services-part-2/","path":"/blog/new-adventures-in-collaboration-apps-services-part-2/","published":"2013-01-17T12:00:00-06:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eIn the \u003ca target=\"_blank\" href=\"/blog/new-adventures-in-collaboration-apps-services-part-1\"\u003efirst part\u003c/a\u003e of this series, I wrote about the applications and services that we are constantly using for collaboration. However, as we conceive, iterate and perfect the products that we are designing and developing, there are several services in the background that make collaborating as team much easier.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eCloudApp\u003c/strong\u003e \u0026mdash; \u003cem\u003e\u003ca href=\"http://getcloudapp.com\" target=\"_blank\"\u003eGetCloudApp.com\u003c/a\u003e\u003c/em\u003e\u003cbr\u003e\nWe have been using CloudApp for some time now for the sharing of screenshots. The application has a setting which will automatically upload the screenshots that we snap and copy the unique url onto our clipboard. This allows for us to quickly share these screenshots through a chat or message without having to send files back and forth. This also helps to keep my Downloads folder a little less cluttered.\u003c/p\u003e\n\n\u003cp\u003eRecently, I have begun to use CloudApp much more extensively. The raindrop feature allows for me to easily upload a snapshot of whatever I am working on in Photoshop for instant sharing. This, along with the screenshot upload allows for Michael and I to discuss small iterations or to quickly explore a new possibility. Also, using the direct link allows us to embed an image into a \u003ca href=\"http://basecamp.com\" target=\"_blank\"\u003eBasecamp\u003c/a\u003e message. In addition to screenshots and Photoshop captures, the application allows us to share any other type of file by just dragging the item to the menubar icon.\u003c/p\u003e\n\n\u003cp\u003eCloudApp also integrates with some of the other pieces of software that we use on a regular basis. On our macs, we both use Sparrow for email. Attachments can be uploaded to CloudApp with a download link pasted into the message. I have also been using the \u003ca href=\"http://tapbots.com/software\" target=\"_blank\"\u003eTweetbot\u003c/a\u003e applications across all of my devices, which allows me to set my image upload service to CloudApp.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eGit\u003c/strong\u003e \u0026mdash; \u003cem\u003e\u003ca href=\"http://git-scm.com\" target=\"_blank\"\u003eGit-SCM.com\u003c/a\u003e\u003c/em\u003e\u003cbr\u003e\nVersion control is obviously important to any project. We prefer Git and host our public projects \u0026amp; tools and a handful of private repos on \u003ca href=\"https://github.com\" target=\"_blank\"\u003eGitHub\u003c/a\u003e, as well as many other private client projects on \u003ca href=\"https://bitbucket.org\" target=\"_blank\"\u003eBitbucket\u003c/a\u003e. This allows us to keep our source code up to date with each others changes.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eForward\u003c/strong\u003e \u0026mdash; \u003cem\u003e\u003ca href=\"http://forwardhq.com\" target=\"_blank\"\u003eForwardHQ.com\u003c/a\u003e\u003c/em\u003e\u003cbr\u003e\nAs mentioned before, CloudApp is a wonderful tool for sharing screenshots and on most days you will regularly find us sending a number of these links back and forth. However, there are often a number of things that an image can not tell you about a digital experience.\u003c/p\u003e\n\n\u003cp\u003eFor this reason, a lot of our front-end prototyping is done in the browser instead. While often rough, these prototypes allow for us to see how the designed aesthetics and functions are working across different features and viewports. Forward lets Michael instantly share the local version of the application that he is working on via a unique url. I am then able to use the application and provide feedback as we discuss its current state. This is a wonderful tool that provides us with much more detail about the experience than a screenshot would.\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003e\u003ca target=\"_blank\" href=\"/blog/new-adventures-in-collaboration-apps-services-part-3\"\u003eContinue onto the final part of this series.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/new-adventures-in-collaboration-apps-services-part-2/collaboration-part-2-53963c14.jpg"},{"id":"/blog/new-adventures-in-collaboration-apps-services-part-1/","title":"New Adventures In Collaboration (Part 1)","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/new-adventures-in-collaboration-apps-services-part-1/","path":"/blog/new-adventures-in-collaboration-apps-services-part-1/","published":"2013-01-11T12:00:00-06:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eWe work in an industry that is always changing. While the web industry has matured quite a bit, new technologies and methods still arise, warrant consideration and often adaptation. As a studio, we are always improving on what we do with refined processes to create better systems for a improved client experience and more successful products.\u003c/p\u003e\n\n\u003cp\u003ePerhaps the biggest change that we embraced this past year is that I relocated to Chicago. As you might have read in a recent \u003ca href=\"http://www.nytimes.com/2013/01/09/us/nashville-takes-its-turn-in-the-spotlight.html\" target=\"_blank\"\u003eNew York Times article\u003c/a\u003e, Nashville is a wonderful place to live. \u003ca target=\"_blank\" href=\"/\"\u003eLaCroix Design Co.\u003c/a\u003e got its start there as well as many great friendships. It is also where I met my lovely wife. However, after ten years we were in need of a change. Chicago offered new inspiration, a growing tech scene and the opportunity to not own a vehicle. Therefore in June of 2012, we decided to make the move.\u003c/p\u003e\n\n\u003cp\u003eWe often work remotely with a large number of our clients and have experimented with and revised different systems to improve communication throughout the process. While Michael and I enjoy the moments where we are working together on a project, we have found that our best work is often done while working in solitary sprints. These sprints are then followed up with a collaborative assessment.\u003c/p\u003e\n\n\u003cp\u003eThus, the extra distance has not thrown a wrench in the way we operate and in some ways has improved our collaboration process. Of course, we would not be able to pull this off as well without the utilization of some apps and services. Here are some of the tools that we are using for successful internal collaboration and how we are using them. We\u0026rsquo;ve become quite attached to using some of these apps and services so I broke them down into a few posts to be spread out.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eGmail\u003c/strong\u003e \u0026mdash; \u003cem\u003e\u003ca href=\"http://gmail.com\" target=\"_blank\"\u003eGmail.com\u003c/a\u003e\u003c/em\u003e\u003cbr\u003e\nMuch like everyone else, \u003ca href=\"http://gmail.com\" target=\"_blank\"\u003eGmail\u003c/a\u003e powers our email server. We recommend it to all of our clients. For reading mail, we both use Gmail via Fluid on our laptops and the official \u003ca href=\"https://itunes.apple.com/us/app/gmail-email-from-google/id422689480\" target=\"_blank\"\u003eGmail app\u003c/a\u003e on our iOS Devices along with the native client on Android.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eBasecamp\u003c/strong\u003e \u0026mdash; \u003cem\u003e\u003ca href=\"https://basecamp.com\" target=\"_blank\"\u003eBasecamp.com\u003c/a\u003e\u003c/em\u003e\u003cbr\u003e\nBasecamp is at the core of everything that we do. Chrome is open to our Basecamp dashboard whenever we are at the computer. Email is noisy and distracting. It has its purpose and we are guilty of relying on it, a bit too much, just as much as anyone else. However, for communicating with clients and with one another, we use \u003ca href=\"https://basecamp.com\" target=\"_blank\"\u003eBasecamp\u003c/a\u003e whenever possible.\u003c/p\u003e\n\n\u003cp\u003eI personally love to see my inbox at zero. Therefore, actionable items get put into todos, information needing kept into documents, important dates into the calendar and files needing save uploaded. By parsing the necessary information, I am able to delete emails while retaining their content in a much more efficient place. When working with each other and with clients through Basecamp, we are able to bypass this parsing step and get straight into the tasks at hand.\u003c/p\u003e\n\n\u003cp\u003eInternally, we collaborate on proposals, assign each other tasks and discuss new ways in which we might do something. In fact, by the time that you read this blog post, it has already gone back and forth a few times in Basecamp. Whenever we start to discuss a new venture, we create a new project so that we can begin to record any ideas that we may have. In fact, I rely on it so much that I use it for planning vacations with my wife. Basecamp is our most indispensable service that we pay for.\u003c/p\u003e\n\n\u003cp\u003eOne downside to Basecamp is that it also uses email for notification purposes. In order to get around this and alleviate the step of deleting email alerts, we set Gmail to auto-archive Basecamp email alerts and use \u003ca href=\"http://gethqapp.com\" target=\"_blank\"\u003eHeadquarters\u003c/a\u003e to serve up OS X notifications.\u003c/p\u003e\n\n\u003cp\u003eUnfortunately, this creates a bit of trouble when we are out of the office and on our iOS devices. I\u0026rsquo;ve been using \u003ca href=\"http://hojoki.com\" target=\"_blank\"\u003eHojoki\u003c/a\u003e to serve up push notifications. However, I\u0026rsquo;m not in love with this setup and there is plenty of room for it to be improved upon. We both use \u003ca href=\"http://www.thelodgeapp.com\" target=\"_blank\"\u003eLodge\u003c/a\u003e on our iPhones and find it be a fantastic app. Building push notifications into the app would be brilliant and would solve this whole dilemma. If we are casting coins into the well, then it would be great to have Lodge on our iPads as well.\u003c/p\u003e\n\n\u003cp\u003eOne other area of friction that we have using Basecamp is the lack of private messaging. The previous iteration of Basecamp allowed for use to create private messages, todos, documents and files. This allowed for us to communicate internally from within the client project. Thus all of the information was contained in one place in case we would ever have to go back to it. The newest iteration of Basecamp offered enough incentives for us to make the switch despite the lack of private messaging. The much improved interface and speed of the new iteration has definitely been worth it. For large projects, we work around this by creating an internal and external project. Hopefully private messaging is eventually restored and we can return to a communication model that we enjoyed.\u003c/p\u003e\n\n\u003cp\u003eAs I mentioned earlier, Basecamp is the crux of our collaboration. While there are plenty of other services on the market, this one is simple, intuitive and best of all works well for us.\u003c/p\u003e\n\n\u003cp\u003e\u003cstrong\u003eSkype\u003c/strong\u003e \u0026mdash; \u003cem\u003e\u003ca href=\"http://skype.com\" target=\"_blank\"\u003eSkype.com\u003c/a\u003e\u003c/em\u003e\u003cbr\u003e\nI\u0026rsquo;m hesitant to put this application on the list but we do use it everyday for quick dialogue and instant feedback. Unfortunately, a number of contacts are on it so it can be a bit distracting when focus is needed. We are not in love with the interface and it is often buggy. The positives are that we can call one another, screen share and forward calls to it to easily answer while we are at our desk. However, we would most likely trade away some of those benefits for a service that fit us better.\u003c/p\u003e\n\n\u003cp\u003eI think that we may have tried every chat service under the sun. Unfortunately there has not been one that truly fit our needs. Often, they fell short in mobile device compatibility or notifications. Being quite fond of the philosophy of \u003ca href=\"http://37signals.com\" target=\"_blank\"\u003e37signals\u003c/a\u003e, we used \u003ca href=\"https://campfirenow.com\" target=\"_blank\"\u003eCampfire\u003c/a\u003e in hope that it would be our solution. The ability to create separate rooms allowed for us to reduce distraction. However, much like a lot of the service\u0026rsquo;s competitors, it lacked proper iOS applications, notifications and the interface is due for a much needed update. A future iteration of this service addressing the previously mentioned shortfalls, along with Basecamp integration, could be the solution that we have been dreaming of.\u003c/p\u003e\n\n\u003cp\u003eInternally, we have been working on building our own application to fill this void. It is currently a project that is a bit off in the distance as we continue to address our needs so that the application can be correctly tailored to them. However, friction within the chat arena still exists for us. Until a new solution is found or developed, Skype continues to offer a satisfactory platform for collaboration.\u003c/p\u003e\n\n\u003cp\u003e\u003cem\u003e\u003ca target=\"_blank\" href=\"/blog/new-adventures-in-collaboration-apps-services-part-2\"\u003eContinue onto the second part of this series.\u003c/a\u003e\u003c/em\u003e\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/new-adventures-in-collaboration-apps-services-part-1/collaboration-part-1-50d2ae85.jpg"},{"id":"/blog/recommended-reading-insites-the-book/","title":"Recommended Reading - Insites: The Book","description":"LaCroix Design Co. is a web design, product design and development studio that excels in helping businesses better connect with their audience.","url":"http://www.lacroixdesign.net/blog/recommended-reading-insites-the-book/","path":"/blog/recommended-reading-insites-the-book/","published":"2013-01-07T12:00:00-06:00","updated":"2015-01-28T12:44:35-06:00","author":{"name":"James LaCroix","url":"http://www.lacroixdesign.net/team/james-lacroix/","path":"/team/james-lacroix/","thumbnail":"http://www.lacroixdesign.net/images/team/james-lacroix-bd5b0b76.jpg"},"content":"\u003cp\u003eOver this past weekend, I finally got around to reading \u003cem\u003e\u003ca href=\"http://viewportindustries.com/insites-the-book\" target=\"_blank\"\u003eInsites: The Book\u003c/a\u003e\u003c/em\u003e by \u003ca href=\"http://keirwhitaker.com\" target=\"_blank\"\u003eKeir Whitaker\u003c/a\u003e \u0026amp; \u003ca href=\"http://elliotjaystocks.com\" target=\"_blank\"\u003eElliot Jay Stocks\u003c/a\u003e. This wonderfully well written book features personal interviews with leading designers that are helping the shape the web today. Designers, that we regularly find ourselves inspired by. It is a reminder of how honored we are to be part of the thoughtful, hardworking and passionate community that gets to make things for the web.\u003c/p\u003e\n\n\u003cp\u003eClick here to purchase the book.\n\u003ca href=\"http://viewportindustries.com/insites-the-book\" target=\"_blank\"\u003eYou can learn more about the book here.\u003c/a\u003e (not an affiliate link)\u003c/p\u003e\n","thumbnail":"http://www.lacroixdesign.net/images/blog/recommended-reading-insites-the-book/insites-1568efc2.jpg"}]
